// 1. Визначення типу геометричної фігури за допомогою switch:

// Створіть код, який приймає назву геометричної фігури ("коло", "квадрат", "трикутник") і 
// використовуючи switch оператор, виводить повідомлення про кількість сторін цієї фігури 
// (наприклад, "Коло має 0 сторін", "Квадрат має 4 сторони").

console.log('ЗАВДАННЯ 1:');

let whatIsFigure = prompt('Напишіть назву геометричної фігури ("коло", "квадрат", "трикутник") :');

switch (whatIsFigure) {
    case 'коло':
    case 'Коло':
        console.log('Коло має 0 сторін');
        break;
    case 'квадрат':
    case 'Квадрат':
        console.log('Квадрат має 4 сторони');
        break;
    case 'трикутник':
    case 'Трикутник':
        console.log('Трикутник має 3 сторони');
        break;

    default:
        console.log('Невірно написана назва фігури');
        break;
}


// 2. Підрахунок суми парних чисел:

// Створіть код, який використовує цикл while для знаходження суми всіх парних чисел
// в заданому діапазоні (наприклад, від 1 до 20).

console.log('ЗАВДАННЯ 2:');

let whileCounter = 0;
let sum = 0;

while (whileCounter <= 20) {  
    whileCounter++;
    if (whileCounter % 2 == 0) {
        sum += whileCounter;
    }
}

console.log(`Сума парних чисел = ${sum}`);


// 3. Таблиця множення:

// Використовуючи цикл for, напишіть програму, яка генерує "таблицю множення" 
// виводимо в console.log операції  для конкретного числа (наприклад, для числа 5).

console.log('ЗАВДАННЯ 3:');

let num = 5;
let sumNum = 0;

for (let i=0; i<11; i++) {
    sumNum = i * 5;
    console.log(sumNum);
};


// 4. Зворотний лічильник:

// Використовуючи цикл for, напишіть програму, яка виводить числа 
//від 10 до 1 в зворотньому порядку.

console.log('ЗАВДАННЯ 4:');

for (let i=10; i>0; i--) {
    console.log(i)
};


// 5. Визначення чи є число парним чи непарним:

// Напишіть програму, яка приймає число і використовуючи if та for, виводить 
// повідомлення про те, чи є число парним чи непарним.

console.log('ЗАВДАННЯ 5:');

let typeNum = Number(prompt('Напишіть число від 0 до 1.000'));
let result;

if (typeNum<=1000) {
    for (let i=0; i<=typeNum; i++) {
        result = i;
    }
    if ( typeNum % 2 == 0) {
        console.log(`Це число - ${result} - є парним`);
    } else {
        console.log(`Це число - ${result} - не парне`);
    }
} else {
    console.log('Ви ввели не коректне число');
}


// 6. Знаходження першого парного числа:

// Напишіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і 
// виводить перше знайдене парне число. Використайте оператор break, щоб припинити 
// виконання циклу, якщо парне число знайдено.

console.log('ЗАВДАННЯ 6:');

for (let index = 1; index < 10; index++) {
    if (index % 2 === 0) {
        console.log(index);
        if (index % 2 === 0) {
            break;
        }
    }
}


// 7. Виведення парних чисел:

// Створіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і виводить 
// тільки парні числа. Використайте оператор continue, щоб пропустити ітерації для непарних чисел.

console.log('ЗАВДАННЯ 7:');

for (let index = 1; index < 11; index++) {
    if (index % 2 != 0) {
        continue;
    }
    console.log(index);
}